package xyz.itwill.student;

import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/* Á¤±ÔÇ¥Çö½Ä(Regular Expression) : Meta¹®ÀÚ , Escape ¹®ÀÚµîÀ» ÀÌ¿ëÇÏ¿© ÀÏÁ¤ÇÑ ±ÔÄ¢(Çü½Ä)ÀÇ Çü½Ä¿¡
 * ¹®ÀÚ¿­À» Ç¥ÇöÇÏ´Â ¹æ¹ı - ÀÚ¹Ù½ºÅ©¸³Æ®·Î ¸¹ÀÌ ÇÔ 
 * ^¹®ÀÚ : ¹®ÀÚ(¿­)·Î ½ÃÀÛµÊÀ» ÀÇ¹Ì  ex ) ^a : a·Î½ÃÀÛµÇ´Â 
 * ¹®ÀÚ$ : ¹®ÀÚ(¿­)·Î Á¾·áµÊÀ» ÀÇ¹Ì 
 * . : ÀÓÀÇÀÇ ¹®ÀÚ ÇÏ³ª¸¦ ÀÇ¹Ì (\ ¹®ÀÚ Ç¥Çö ºÒ°¡´É)
 * [¹®ÀÚ1¹®ÀÚ2¹®ÀÚ3] : ³ª¿­µÈ ¹®ÀÚµé Áß ÇÏ³ª¸¦ ÀÇ¹Ì  
 * [^¹®ÀÚ1¹®ÀÚ2¹®ÀÚ3] : ³ª¿­µÈ ¹®ÀÚµéÀÌ ¾Æ´Ñ ¹®ÀÚ Áß ÇÏ³ª¸¦ ÀÇ¹Ì 
 * [¹®ÀÚ1-¹®ÀÚ2] : ¹®ÀÚ1ºÎÅÍ ¹®ÀÚ2 ¹üÀ§ÀÇ ¹®ÀÚ Áß ÇÏ³ª¸¦ ÀÇ¹Ì 
 * ([¹®ÀÚ¿­1|¹®ÀÚ¿­2|¹®ÀÚ¿­3]) : ³ª¿­µÈ ¹®ÀÚ¿­Áß ÇÏ³ª¸¦ ÀÇ¹Ì 
 * ¹®ÀÚ¿­+ : ¹®ÀÚ¿­ÀÌ 1¹øÀÌ»ó ¹İº¹µÊÀ» ÀÇ¹Ì   
 * ¹®ÀÚ¿­* : ¹®ÀÚ¿­ÀÌ 0¹øÀÌ»ó ¹İº¹µÊÀ» ÀÇ¹Ì   
 * ¹®ÀÚ¿­? : ¹®ÀÚ¿­ÀÌ 0¹ø ¶Ç´Â 1¹ø Á¸ÀçÇÔÀ» ÀÇ¹Ì
 * ¹®ÀÚ¿­{¼ıÀÚ} : ¹®ÀÚ¿­ÀÌ ¼ıÀÚ¸¸Å­ ¹İº¹µÊÀ» ÀÇ¹Ì  ex) A{5} A°¡ 5¹ø 
 * ¹®ÀÚ¿­{¼ıÀÚ1,¼ıÀÚ2} : ¹®ÀÚ¿­ÀÌ ¼ıÀÚ1ºÎÅÍ ¼ıÀÚ2 ¹üÀ§¸¸Å­ ¹İº¹µÊÀ» ÀÇ¹Ì 
 * (¹®ÀÚ¿­1|¹®ÀÚ¿­2|¹®ÀÚ¿­3) : ³ª¿­µÈ ¹®ÀÚ¿­ Áß ÇÏ³ª¸¦ ÀÇ¹Ì
 * (?!)¹®ÀÚ¿­ : ¹®ÀÚ¿­¿¡¼­ ´ë¼Ò¹®ÀÚ¸¦ ±¸ºĞÇÏÁö ¾ÊÀ½À» ÀÇ¹Ì 
 * (?=¹®ÀÚ¿­) : ¹®ÀÚ¿­À» ¹İµå½Ã Æ÷ÇÔÇÏ°í ÀÖÀ½À» ÀÇ¹Ì 
 * (?!¹®ÀÚ¿­ : ¹®ÀÚ¿­À» ¹İµå½Ã Æ÷ÇÔÇÏ°í ÀÖÁö ¾ÊÀ½À» ÀÇ¹Ì 
 *  
 *  È¸ÇÇ¹®ÀÚ
 *  \s : °ø¹éÀÌ Á¸ÀçÇÏ´Â ¹®ÀÚ¿­À» ÀÇ¹Ì 
 *  \S : °ø¹éÀÌ Á¸ÀçÇÏÁö ¾Ê´Â ¹®ÀÚ¿­À» ÀÇ¹Ì
 *  \w : ¿µ¹®ÀÚ,¼ıÀÚ,Æ¯¼ö¹®ÀÚ(_)ÀÇ ¹®ÀÚ·Î¸¸ ±¸¼ºµÈ ¹®ÀÚ¿­À» ÀÇ¹Ì
 *  \W : ¿µ¹®ÀÚ,¼ıÀÚ,Æ¯¼ö¹®ÀÚ(_)ÀÇ ¹®ÀÚ¸¦ Á¦¿ÜÇÑ ¹®ÀÚ·Î¸¸ ±¸¼ºµÈ ¹®ÀÚ¿­À» ÀÇ¹Ì
 *  \d : ¼ıÀÚ Çü½ÄÀÇ ¹®ÀÚ·Î¸¸ ±¸¼ºµÈ ¹®ÀÚ¿­À» ÀÇ¹Ì
 *  \D : ¹®ÀÚ Çü½ÄÀÇ ¹®ÀÚ¸¦ Á¦¿ÜÇÑ ¹®ÀÚµé·Î ±¸¼ºµÈ ¹®ÀÚ¿­À» À¸¹Ì¤Ó
 *  \¸ŞÅ¸¹®ÀÚ : ¸ŞÅ¸¹®ÀÚ¸¦ ÀÏ¹İ ¹®ÀÚ·Î Ç¥ÇöÇÔÀ» ÀÇ¹Ì 
 *  
 *       str.matches("^[0-9]*$")
 *            
 *      Pattern Å¬·¡½º - 
 *        Pattern pattern = Pattern.compile("^[a-zA-Z]*$"); //¿µ¹®ÀÚ¸¸
            String val = "abcdef"; //´ë»ó¹®ÀÚ¿­
	
            Matcher matcher = pattern.matcher(val);
            System.out.println(matcher.find());
            
        Á¤±Ô Ç¥Çö½ÄÀº À¯È¿¼º °Ë»ç ÄÚµå ÀÛ¼º ½Ã °¡Àå È¿À²ÀûÀÎ ¹æ¹ıÀÔ´Ï´Ù
        boolean name_check = Pattern.matches("^[°¡-ÆR]*$", name);
        Pattern.matches("^01(?:0|1|[6-9])-(?:\\d{3}|\\d{4})-\\d{4}$", tel);
        Pattern.matches("\\w+@\\w+\\.\\w+(\\.\\w+)?", email); 
 */

// À¯È¿¼º °Ë»ç - Á¤±Ô½Ä 
//Å°º¸µå·Î ÀÔ·ÂµÈ ¹®ÀÚ¿­¿¡ ´ëÇÑ °ËÁõ ÇÁ·Î±×·¥ - ÀÔ·Â°ª À¯È¿¼º °ËÁõ  
// => Çü½Ä¿¡ ¸ÂÁö¾Ê´Â ¹®ÀÚ¿­À» ÀÔ·ÂÇÑ °æ¿ì ÇÁ·Î±×·¥ Á¾·á 
public class DataValidationApp {
	
	public static void main(String[] args) throws IOException {
		
		BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
		/*
		System.out.print("¾ÆÀÌµğ ÀÔ·Â >> ");
		String id = br.readLine();
		
		// ÀÔ·Â°ª À¯¹«¿¡ ´ëÇÑ °ËÁõ : ¿¬»êÀÚ ¶Ç´Â String Å¬·¡½ºÀÇ ¸Ş¼­µå¸¦ ÀÌ¿ëÇÑ ÀÔ·Â°ª °ËÁõ  
		if(id == null || id.equals("")) {
			System.out.println("[¿¡·¯] ¾ÆÀÌµğ¸¦ ¹İµå½Ã ÀÔ·ÂÇØ ÁÖ¼¼¿ä.");
			System.exit(0);
		} 
		
		// ÀÔ·Â°ª Çü½Ä¿¡ ´ëÇÑ °ËÁõ - Á¤±Ô Ç¥Çö½ÄÀ» ÀÌ¿ëÇÑ À¯È¿¼º °Ë»ç 
		// ¾ÆÀÌµğ Çü½Ä - ¿µ¹®ÀÚ·Î ½ÃÀÛµÇ¸ç ¿µ¹®ÀÚ,¼ıÀÚ,Æ¯¼ö¹®ÀÚ(_)ÀÇ Á¶ÇÕÀ¸·Î 6~20 ¹üÀ§ÀÇ ¹®ÀÚ·Î Ç¥Çö
		
		String idReg="^[a-zA-Z][a-zA-Z0-9_]{5,19}$"; // ¿µ¹®ÀÚ·Î ½ÃÀÛ  ¼Ò¹®ÀÚÁß ÇÏ³ª ´ë¹®ÀÚÁß ÇÏ³ª 5¹ø~19¹ø ¹İº¹ÇØ¼­ ³¡³ª´Â
			//	\\w ¿µ¹®ÀÚ,¼ıÀÚ,Æ¯¼ö¹®ÀÚ(_)ÀÇ ¹®ÀÚ·Î¸¸ ±¸¼ºµÈ ¹®ÀÚ¿­À» ÀÇ¹Ì, w ¾²±âÀ§ÇØ¼­ ¿ª½½·¡½¬ 2¹ø½á¾ß µÊ 
		// String idReg="^[a-zA-Z]\\w{5,19}$"
			
		// java.util.regex.Pattern : Á¤±ÔÇ¥Çö½ÄÀ» ÀúÀåÇÏ±â À§ÇÑ Å¬·¡½º
		// Pattern.matches(String regex , CharSequence input) : Á¤±Ô Ç¥Çö½Ä °ú ÀÔ·Â°ªÀ» Àü´Ş¹Ş¾Æ 
		// ÀÔ·Â°ª¿¡ ´ëÇÑ ±ÔÄ¢À» ºñ±³ÇÏ¿© °á°ú¸¦ ¹İÈ¯ÇÏ´Â ¸Ş¼­µå 
		// => false : Á¤±Ô Ç¥Çö½ÄÀÇ  Çü½Ä°ú ºÒÀÏÄ¡ , true : Á¤±Ô Ç¥Çö½ÄÀÇ Çü½Ä°ú ÀÏÄ¡ 
		// ¾ÆÀÌµğ¿¡ ´ëÇÑ Çü½ÄÀ» Á¤±Ô Ç¥Çö½ÄÀ¸·Î ±¸ÇöÇÏ¿© ÀúÀå 
		// ÀÔ·Â°ª°ú Á¤±ÔÇ¥Çö½ÄÀ» ºñ±³ÇÏ¿© Çü½Ä¿¡ ¸ÂÁö ¾ÊÀº °æ¿ì ÇÁ·Î±×·¥ Á¾·á 
		
		/*
		if(!Pattern.matches(idReg, id)) { // idReg¿Í id ºñ±³ÇÔ <--------------------------ÀÌ¹æ¹ıÀ» ¸¹ÀÌ ¾´´Ù.
			System.out.println("[¿¡·¯]ÀÔ·ÂÇÑ ¾ÆÀÌµğ´Â Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù. ");
			System.exit(0);
		}
		// Pattern.compile(String regex) : Á¤±ÔÇ¥Çö½ÄÀ» Àü´Ş¹Ş¾Æ Pattern ÀÎ½ºÅÏ½º¿¡ ÀúÀåÇÏ¿©
		// ¹İÈ¯ÇÏ´Â ¸Ş¼­µå 
		Pattern idPattern = Pattern.compile(idReg); // Çü½ÄÀÌ ¸Â³ª 
		
		// java.util.regex.Matcher : Á¤±Ô Ç¥Çö½Ä°ú ºñ±³ ¹®ÀÚ¿­À» ÀúÀåÇÏ±â À§ÇÑ Å¬·¡½º  
		// => Á¤±Ô Ç¥Çö½Ä°ú ¹®ÀÚ¿­À» ºñ±³ÇÏ´Â ±â´É¿Ü¿¡ °Ë»ö ¶Ç´Â º¯°æ ,  »èÁ¦ Ã³¸®ÇÏ´Â ¸Ş¼­µå¸¦ Á¦°øÇÑ´Ù.  
		// Pattern.matcher(CharSequence input) : Pattern ÀÎ½ºÅÏ½º¿¡ ÀúÀåµÈ Á¤±Ô Ç¥Çö½Ä°ú
		// ºñ±³ ¹®ÀÚ¿­À» Á¦°ø ¹Ş¾Æ ÀúÀåÇÑ Matcher ÀÎ½ºÅÏ½º¸¦ ¹İÈ¯ÇÏ´Â ¸Ş¼­µå 
		Matcher idMatcher = idPattern.matcher(id); 
		
		// Matcher.matches() : Matcher ÀÎ½ºÅÏ½º¿¡ ÀúÀåµÈ Á¤±ÔÇ¥Çö½Ä°ú ºñ±³ ¹®ÀÚ¿­À» ºñ±³ÇÏ¿© 
		// °á°ú (boolean)¸¦ ¹İÈ¯ÇÏ´Â ¸Ş¼­µå
		// => false : Á¤±Ô Ç¥Çö½ÄÀÇ  Çü½Ä°ú ºÒÀÏÄ¡ , true : Á¤±Ô Ç¥Çö½ÄÀÇ Çü½Ä°ú ÀÏÄ¡
		// find() : °Ë»öÇÏ´Â°Å , matches () : ºñ±³ÇÏ´Â°Å , append() ¹Ù²ã¼­ Ãß°¡ , replace() ´Ù¹Ù²Ş
		// reset() : ÃÊ±âÈ­ 
	
		
		if(!idMatcher.matches()) { // Á¤±ÔÇ¥Çö½Ä°ú ÀÔ·Â ¹®ÀÚ¿­¿¡ ´ëÇÑ ºñ±³ 
			System.out.println("[¿¡·¯] ÀÔ·ÂÇÑ ¾ÆÀÌµğ´Â Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù.");
			System.exit(0);
		}		
		System.out.println("[¸Ş¼¼Áö] Çü½Ä¿¡ ¸Â´Â ¾ÆÀÌµğ¸¦ ÀÔ·ÂÇÏ¿´½À´Ï´Ù.");						
		
		*/
		
		/*
		System.out.print("ºñ¹Ğ¹øÈ£ ÀÔ·Â >> ");
		String password = br.readLine();
		
		if(password == null || password.equals("")) {
			System.out.println("[¿¡·¯] ºñ¹Ğ¹øÈ£¸¦ ¹İµå½Ã ÀÔ·ÂÇØ ÁÖ¼¼¿ä.");
			System.exit(0);
		} 
		//ºñ¹Ğ¹øÈ£ Çü½Ä : ¿µ¹®ÀÚ , ¼ıÀÚ , Æ¯¼ö¹®ÀÚ¸¦ ¹İµå½Ã 1°³ÀÌ»ó Æ÷ÇÔÇÏ¿© 8~30 ¹üÀ§ÀÇ ¹®ÀÚ·Î Ç¥Çö
		// ?= ¹®ÀÚ¿­À» ¹İµå½Ã Æ÷ÇÔ  , . ÀÓÀÇÀÇ ¹®ÀÚ ÇÏ³ª , * ¹İµå½Ã ÇÏ³ª ÀÌ»ó 
		String passwordReg = "^(?=.*[a-zA-Z])(?=.*[0-9])(?=.*[~!@#$%^&*_-]).{8,30}$";  // -_ ¸¦ ¶ß¸é * ºÎÅÍ _ ±îÁö·Î ÀÎ½ÄÇÏ°Ô µÇ¼­ _- ·Î ¸¶Áö¸·¿¡ ½á¾ßµÊ
		if(!Pattern.matches(passwordReg, password)) {
			System.out.println("[¿¡·¯]ÀÔ·ÂÇÑ ºñ¹Ğ¹øÈ£´Â Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù.");
			System.exit(0);
		}
		System.out.println("[¸Ş¼¼Áö] Çü½Ä¿¡ ¸Â´Â ºñ¹Ğ¹øÈ£¸¦ ÀÔ·ÂÇÏ¿´½À´Ï´Ù.");
		
		*/
		
		System.out.print("ÀÌ¸ŞÀÏ ÀÔ·Â >> ");
		String email = br.readLine();
		
		if(email == null || email.equals("")) {
			System.out.println("[¿¡·¯] ÀÌ¸ŞÀÏÀ» ¹İµå½Ã ÀÔ·ÂÇØ ÁÖ¼¼¿ä.");
			System.exit(0);
		}
		
		// ÀÌ¸ŞÀÏ Çü½Ä : [»ç¿ëÀÚ¸í@µµ¸ŞÀÎ¸í] Çü½ÄÀÇ ¹®ÀÚ¿­·Î Ç¥Çö
		// + ÇÑ¹øÀÌ»ó ¹İº¹ 
		// \\. ¸ŞÅ¸¹®ÀÚ . 

		String emailReg = "^([a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\\.[a-zA-Z0-9_-]+)+)*$"; // QKRQJA@NAVER.CO.KR    @ABC_ ¶Ç´Â ABC- ¾²´Â ¸ŞÀÏµµ ÀÖ¾î¼­ 
																		//  .µÚ¿¡ ¹®ÀÚÇÑ¹øÀÌ»ó ¹İº¹ +    ,   . ÇÑ¹øÀÌ»ó¹İº¹ +
		if(!Pattern.matches(emailReg, email)) {
			System.out.println("Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù.");
			System.exit(0);
		}
		System.out.println("[¸Ş¼¼Áö] Çü½Ä¿¡ ¸Â´Â ÀÌ¸ŞÀÏÀ» ÀÔ·ÂÇÏ¿´½À´Ï´Ù.");
		
		// Ajax ÀÔ·ÂÇÏÀÚ¸¶ÀÚ Çü½Ä¿¡ ¸Â´ÂÁö ¹Ù·Î °Ë»çÇØÁØ´Ù. Á¤±ÔÇ¥Çö½ÄÀº ÀÚ¹Ù½ºÅ©¸³Æ®·Î ¸¹ÀÌ ¸¸µç´Ù.
	}
}